app/Controllers/ChatController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function index()
    {
        $this->requireAuth();

        $currentUserId = session()->get('user_id');
        $currentUser = $this->userModel->find($currentUserId);

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function fetchMessages()
    {
        $this->requireAuth();

        // Log the request for debugging
        log_message('debug', 'Fetch messages request: ' . json_encode([
            'is_ajax' => $this->request->isAJAX(),
            'method' => $this->request->getMethod(),
            'headers' => $this->request->getHeaders(),
            'user_id' => $this->request->getGet('user_id')
        ]));

        if (!$this->request->isAJAX()) {
            return $this->response->setJSON(['error' => 'Invalid request - not AJAX']);
        }

        $currentUserId = session()->get('user_id');
        $otherUserId = $this->request->getGet('user_id');

        if (empty($otherUserId)) {
            return $this->response->setJSON(['error' => 'User ID is required']);
        }

        // Validate other user exists
        $otherUser = $this->userModel->find($otherUserId);

UPDATE `users` SET `last_activity` = '2025-09-03 02:51:50', `updated_at` = '2025-09-03 02:51:50'
WHERE `users`.`id` IN ('2')
---
    public function updateActivity()
    {
        $this->requireAuth();

        if (!$this->request->isAJAX()) {
            return $this->response->setJSON(['error' => 'Invalid request']);
        }

        $currentUserId = session()->get('user_id');

        // Update last activity
        $this->userModel->update($currentUserId, [
            'last_activity' => date('Y-m-d H:i:s')
        ]);