app/Controllers/DashboardController.php

    private function getDashboardStats()
    {
        $today = date('Y-m-d');
        $thisMonth = date('Y-m');

        // Today's sales
        $todaySales = $this->saleModel->getDailySales($today);

        // This month's sales
        $monthlySales = $this->saleModel->getMonthlySales(date('Y'), date('m'));
        $monthlyTotal = 0;
        if ($monthlySales) {
            foreach ($monthlySales as $sale) {
                $monthlyTotal += $sale['total_revenue'];
            }
        }

        // Product statistics
        $productStats = $this->productModel->getProductStats();

        // User statistics
        $totalUsers = $this->userModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`