app/Models/MessageModel.php

    public function getConversation($user1Id, $user2Id, $limit = 50, $offset = 0)
    {
        return $this->select('messages.*,
                              u1.full_name as sender_name,
                              u1.role as sender_role,
                              u2.full_name as receiver_name,
                              u2.role as receiver_role')
                    ->join('users u1', 'u1.id = messages.sender_id')
                    ->join('users u2', 'u2.id = messages.receiver_id')
                    ->where("(sender_id = $user1Id AND receiver_id = $user2Id) OR (sender_id = $user2Id AND receiver_id = $user1Id)")
                    ->orderBy('created_at', 'ASC')
                    ->limit($limit, $offset)
                    ->get()
                    ->getResultArray();
---
SELECT `messages`.*, `u1`.`full_name` as `sender_name`, `u1`.`role` as `sender_role`, `u2`.`full_name` as `receiver_name`, `u2`.`role` as `receiver_role`
FROM `messages`
JOIN `users` `u1` ON `u1`.`id` = `messages`.`sender_id`
JOIN `users` `u2` ON `u2`.`id` = `messages`.`receiver_id`
WHERE (`sender_id` = 2 AND `receiver_id` = 1) OR (`sender_id` = 1 AND `receiver_id` = 2)
ORDER BY `created_at` ASC
 LIMIT 50

    public function getUnreadCount($userId)
    {
        return $this->where('receiver_id', $userId)
                    ->where('is_read', 0)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `messages`
WHERE `receiver_id` = '2'
AND `is_read` = 0

    public function markAsRead($senderId, $receiverId)
    {
        return $this->where('sender_id', $senderId)
                    ->where('receiver_id', $receiverId)
                    ->where('is_read', 0)
                    ->set(['is_read' => 1])
                    ->update();
---
UPDATE `messages` SET `is_read` = 1, `updated_at` = '2025-09-03 02:52:35'
WHERE `sender_id` = '1'
AND `receiver_id` = '2'
AND `is_read` = 0

    public function getOnlineUsers($currentUserId)
    {
        $userModel = new \App\Models\UserModel();

        // First try to get users active in the last 5 minutes
        $recentUsers = $userModel->select('id, full_name, role, last_activity')
                        ->where('id !=', $currentUserId)
                        ->where('last_activity >', date('Y-m-d H:i:s', strtotime('-5 minutes')))
                        ->where('is_active', 1)
                        ->orderBy('last_activity', 'DESC')
                        ->get()
                        ->getResultArray();
---
SELECT `id`, `full_name`, `role`, `last_activity`
FROM `users`
WHERE `id` != '2'
AND `last_activity` > '2025-09-03 02:46:54'
AND `is_active` = 1
ORDER BY `last_activity` DESC