app/Models/ProductModel.php

    public function getProducts($search = '', $category = '', $page = 1, $perPage = 20)
    {
        $builder = $this->builder();

        if (!empty($search)) {
            $builder->groupStart()
                    ->like('name', $search)
                    ->orLike('product_code', $search)
                    ->orLike('description', $search)
                    ->groupEnd();
        }

        if (!empty($category)) {
            $builder->where('category', $category);
        }

        $builder->where('is_active', true);

        $total = $builder->countAllResults(false);

        $offset = ($page - 1) * $perPage;
        $products = $builder->limit($perPage, $offset)
                           ->orderBy('name', 'ASC')
                           ->get()
                           ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE   (
`name` LIKE '%Camel Blue%' ESCAPE '!'
OR  `product_code` LIKE '%Camel Blue%' ESCAPE '!'
OR  `description` LIKE '%Camel Blue%' ESCAPE '!'
 )
AND `is_active` = 1
SELECT *
FROM `products`
WHERE   (
`name` LIKE '%Camel Blue%' ESCAPE '!'
OR  `product_code` LIKE '%Camel Blue%' ESCAPE '!'
OR  `description` LIKE '%Camel Blue%' ESCAPE '!'
 )
AND `is_active` = 1
ORDER BY `name` ASC
 LIMIT 20

    public function getCategories()
    {
        $categories = $this->select('category')
                   ->distinct()
                   ->where('is_active', true)
                   ->orderBy('category', 'ASC')
                   ->get()
                   ->getResultArray();
---
SELECT DISTINCT `category`
FROM `products`
WHERE `is_active` = 1
ORDER BY `category` ASC

    public function getLowStockProducts()
    {
        return $this->where('quantity <= min_stock')
                   ->where('is_active', true)
                   ->findAll();
---
SELECT *
FROM `products`
WHERE `quantity` <= min_stock
AND `is_active` = 1

    public function getProductStats()
    {
        $stats = [
            'total_products' => $this->where('is_active', true)->countAllResults(),
            'low_stock_count' => $this->where('quantity <= min_stock')->where('is_active', true)->countAllResults(),
            'out_of_stock_count' => $this->where('quantity', 0)->where('is_active', true)->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `quantity` <= min_stock
AND `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `quantity` = 0
AND `is_active` = 1