app/Models/SaleModel.php

SELECT *
FROM `sales`
WHERE DATE(created_at) = '2025-09-03'
ORDER BY `id` DESC
 LIMIT 1
---
    public function generateSaleNumber()
    {
        $prefix = 'SALE';
        $date = date('Ymd');
        $lastSale = $this->where('DATE(created_at)', date('Y-m-d'))
                         ->orderBy('id', 'DESC')
                         ->first();

SELECT COUNT(*) AS `numrows`
FROM `sales`
SELECT `sales`.*, `users`.`full_name` as `cashier_name`
FROM `sales`
JOIN `users` ON `users`.`id` = `sales`.`user_id`
ORDER BY `sales`.`created_at` DESC
 LIMIT 5
---
    public function getSales($filters = [], $page = 1, $perPage = 20)
    {
        $builder = $this->builder();

        // Apply filters
        if (!empty($filters['start_date'])) {
            $builder->where('DATE(created_at) >=', $filters['start_date']);
        }

        if (!empty($filters['end_date'])) {
            $builder->where('DATE(created_at) <=', $filters['end_date']);
        }

        if (!empty($filters['user_id'])) {
            $builder->where('user_id', $filters['user_id']);
        }

        if (!empty($filters['payment_method'])) {
            $builder->where('payment_method', $filters['payment_method']);
        }

        if (!empty($filters['status'])) {
            $builder->where('status', $filters['status']);
        }

        $total = $builder->countAllResults(false);

        $offset = ($page - 1) * $perPage;
        $sales = $builder->select('sales.*, users.full_name as cashier_name')
                        ->join('users', 'users.id = sales.user_id')
                        ->limit($perPage, $offset)
                        ->orderBy('sales.created_at', 'DESC')
                        ->get()
                        ->getResultArray();

SELECT DATE(created_at) as date, COUNT(*) as total_sales, SUM(total_amount) as total_revenue, SUM(discount) as total_discount, AVG(total_amount) as average_sale
FROM `sales`
WHERE DATE(created_at) = '2025-09-03'
AND `status` = 'completed'
GROUP BY DATE(created_at)
ORDER BY `sales`.`id` ASC
 LIMIT 1
---
    public function getDailySales($date = null)
    {
        if (!$date) {
            $date = date('Y-m-d');
        }

        return $this->select('
                DATE(created_at) as date,
                COUNT(*) as total_sales,
                SUM(total_amount) as total_revenue,
                SUM(discount) as total_discount,
                AVG(total_amount) as average_sale
            ')
            ->where('DATE(created_at)', $date)
            ->where('status', 'completed')
            ->groupBy('DATE(created_at)')
            ->first();

SELECT DATE(created_at) as date, COUNT(*) as total_sales, SUM(total_amount) as total_revenue, SUM(discount) as total_discount
FROM `sales`
WHERE DATE(created_at) >= '2025-08-28'
AND DATE(created_at) <= '2025-09-03'
AND `status` = 'completed'
GROUP BY DATE(created_at)
ORDER BY `date` ASC
---
    public function getWeeklySales($startDate = null, $endDate = null)
    {
        if (!$startDate) {
            $startDate = date('Y-m-d', strtotime('monday this week'));
        }
        if (!$endDate) {
            $endDate = date('Y-m-d', strtotime('sunday this week'));
        }

        return $this->select('
                DATE(created_at) as date,
                COUNT(*) as total_sales,
                SUM(total_amount) as total_revenue,
                SUM(discount) as total_discount
            ')
            ->where('DATE(created_at) >=', $startDate)
            ->where('DATE(created_at) <=', $endDate)
            ->where('status', 'completed')
            ->groupBy('DATE(created_at)')
            ->orderBy('date', 'ASC')
            ->findAll();

SELECT DATE(created_at) as date, COUNT(*) as total_sales, SUM(total_amount) as total_revenue, SUM(discount) as total_discount
FROM `sales`
WHERE YEAR(created_at) = '2025'
AND MONTH(created_at) = '09'
AND `status` = 'completed'
GROUP BY DATE(created_at)
ORDER BY `date` ASC
---
    public function getMonthlySales($year = null, $month = null)
    {
        if (!$year) {
            $year = date('Y');
        }
        if (!$month) {
            $month = date('m');
        }

        return $this->select('
                DATE(created_at) as date,
                COUNT(*) as total_sales,
                SUM(total_amount) as total_revenue,
                SUM(discount) as total_discount
            ')
            ->where('YEAR(created_at)', $year)
            ->where('MONTH(created_at)', $month)
            ->where('status', 'completed')
            ->groupBy('DATE(created_at)')
            ->orderBy('date', 'ASC')
            ->findAll();