app/Models/UserModel.php

    public function getActiveUsers()
    {
        return $this->where('is_active', true)->findAll();
---
SELECT *
FROM `users`
WHERE `is_active` = 1